STMicroelectronics/STM32CubeWBA/Projects/NUCLEO-WBA25CE/Applications/BLE/BLE_Security_Central/STM32_WPAN/App/gatt_client_app.c
  /* USER CODE BEGIN GATT_CLIENT_APP_WriteCharacteristic_2 */

  /* USER CODE END GATT_CLIENT_APP_WriteCharacteristic_2 */

  return procClientContext.gatt_error_code;
}

/* USER CODE BEGIN LF */
static void Security_client_write_char(void)
{
  /* Specific implementation for CFG_TASK_WRITE_CHAR_ID */
  
  uint8_t index = 0;
  tBleStatus ret = BLE_STATUS_INVALID_PARAMS;

  if (SecurityButtonData.level == 0x00)
  {
    SecurityButtonData.level = 0x01;
  }
  else
  {
    SecurityButtonData.level = 0x00;
  }

  for(index = 0; index < CFG_BLE_NUM_CLIENT_CONTEXTS; index++)
  {
    if (a_ClientContext[index].state == GATT_CLIENT_APP_CONNECTED)
    {
      ret = aci_gatt_write_without_resp(a_ClientContext[index].connHdl,
                                            a_ClientContext[index].SecurityWriteToServerValueHdl,
                                            2,
                                            (uint8_t *)&SecurityButtonData);

      if (ret != BLE_STATUS_SUCCESS)
      {
        APP_DBG_MSG("aci_gatt_clt_write_without_resp failed, connHdl=0x%04X, ValueHdl=0x%04X\n",
                    a_ClientContext[index].connHdl,
                    a_ClientContext[index].SecurityWriteToServerValueHdl);
      }
      else
      {
        APP_DBG_MSG("aci_gatt_clt_write_without_resp success, connHdl=0x%04X, ValueHdl=0x%04X\n",
                    a_ClientContext[index].connHdl,
                    a_ClientContext[index].SecurityWriteToServerValueHdl);
      }
      
    }
  }

  return;
}
/* USER CODE END LF */
